IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_FSI0_RX0_CONTROLSS_FSI0_RX0.xml
	<register id="CONTROLSS_FSI0_RX0_RX_PING_TAG" acronym="CONTROLSS_FSI0_RX0_RX_PING_TAG" offset="0x2E" width="16" description="">
		<bitfield id="PING_TAG" width="4" begin="4" end="1" resetval="0x0" description="Received Ping Frame Tag This field contains the 4-bit frame tag from the last successfully received ping frame. This is intentionally shifted into bits 4:1 so that the register can be used as a 32-bit address index based on the received tag." range="4 - 1" rwaccess="RO"/> 
		<bitfield id="RESERVED" width="1" begin="0" end="0" resetval="0x0" description="Zero bit This bit will always read  as 0. This is intentionally provided to create a 32-bit offset if required. Using the PING_TAG  and ZERO bits of this register (bits 4:0), application software can directly index into an array of 32-bit data." range="0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_FSI0_RX0_RX_PING_WD_REF" acronym="CONTROLSS_FSI0_RX0_RX_PING_WD_REF" offset="0x30" width="32" description="">
		<bitfield id="PING_WD_REF" width="32" begin="31" end="0" resetval="0x0" description="Ping Watchdog Counter Reference Value This is the 32-bit reference value for the ping watchdog timeout counter. The counter will count up starting from 0 and continue counting until this value is reached." range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_FSI0_RX0_RX_PING_WD_CNT" acronym="CONTROLSS_FSI0_RX0_RX_PING_WD_CNT" offset="0x34" width="32" description="">
		<bitfield id="PING_WD_CNT" width="32" begin="31" end="0" resetval="0x0" description="Ping Watchdog Counter Value This is the 32-bit read-only register which shows the current value of the ping watchdog counter. This counter is reset to 0 in a variety of ways: A write to PING_WD_RST, a match with PING_WD_REF, or the reception of a ping frame." range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_FSI0_RX0_RX_INT1_CTRL_ALT1_" acronym="CONTROLSS_FSI0_RX0_RX_INT1_CTRL_ALT1_" offset="0x38" width="16" description="">
		<bitfield id="INT1_EN_ERROR_TAG_MATCH" width="1" begin="14" end="14" resetval="0x0" description="Enable Error Frame Received with Tag Match Interrupt to INT1 bit This is an enable register which decides whether an interrupt (RX_INT1) will be generated on the enabled event.  0h (R/W) = This event will not trigger an interrupt on RX_INT1. 1h (R/W) = An error frame received with matching tag will trigger an interrupt on RX_INT1. The event itself will be latched in the corresponding bit in the RX_EVT_STS Register" range="14" rwaccess="RW"/> 
		<bitfield id="INT1_EN_DATA_TAG_MATCH" width="1" begin="13" end="13" resetval="0x0" description="Enable Data Frame Received with Tag Match Interrupt to INT1 bit This is an enable register which decides whether an interrupt (RX_INT1) will be generated on the enabled event.  0h (R/W) = This event will not trigger an interrupt on RX_INT1. 1h (R/W) = A data frame received with matching tag will trigger an interrupt on RX_INT1. The event itself will be latched in the corresponding bit in the RX_EVT_STS Register" range="13" rwaccess="RW"/> 
		<bitfield id="INT1_EN_PING_TAG_MATCH" width="1" begin="12" end="12" resetval="0x0" description="Enable Ping Frame Received with Tag Match Interrupt to INT1 bit This is an enable register which decides whether an interrupt (RX_INT1) will be generated on the enabled event.  0h (R/W) = This event will not trigger an interrupt on RX_INT1. 1h (R/W) = A ping frame received with matching tag will trigger an interrupt on RX_INT1. The event itself will be latched in the corresponding bit in the RX_EVT_STS Register" range="12" rwaccess="RW"/> 
		<bitfield id="INT1_EN_DATA_FRAME" width="1" begin="11" end="11" resetval="0x0" description="Enable Data Frame Received Interrupt to INT1 bit This is an enable register which decides whether an interrupt (RX_INT1) will be generated on the enabled event.  0h (R/W) = This event will not trigger an interrupt on RX_INT1. 1h (R/W) = A data frame received event will trigger an interrupt on RX_INT1. The event itself will be latched in the corresponding bit in the RX_EVT_STS Register" range="11" rwaccess="RW"/> 
		<bitfield id="INT1_EN_FRAME_OVERRUN" width="1" begin="10" end="10" resetval="0x0" description="Enable Frame Overrun Interrupt to INT1 bit This is an enable register which decides whether an interrupt (RX_INT1) will be generated on the enabled event.  0h (R/W) = This event will not trigger an interrupt on RX_INT1. 1h (R/W) = A frame overrun event will trigger an interrupt on RX_INT1. The event itself will be latched in the corresponding bit in the RX_EVT_STS Register" range="10" rwaccess="RW"/> 
		<bitfield id="INT1_EN_PING_FRAME" width="1" begin="9" end="9" resetval="0x0" description="Enable Ping Frame Received Interrupt to INT1 bit This is an enable register which decides whether an interrupt (RX_INT1) will be generated on the enabled event.  0h (R/W) = This event will not trigger an interrupt on RX_INT1. 1h (R/W) = A ping frame received event will trigger an interrupt on RX_INT1. The event itself will be latched in the corresponding bit in the RX_EVT_STS Register" range="9" rwaccess="RW"/> 
		<bitfield id="INT1_EN_ERR_FRAME" width="1" begin="8" end="8" resetval="0x0" description="Enable ERROR Frame Received Interrupt to INT1 bit This is an enable register which decides whether an interrupt (RX_INT1) will be generated on the enabled event.  0h (R/W) = This event will not trigger an interrupt on RX_INT1. 1h (R/W) = A error frame received event will trigger an interrupt on RX_INT1. The event itself will be latched in the corresponding bit in the RX_EVT_STS Register" range="8" rwaccess="RW"/> 
		<bitfield id="INT1_EN_UNDERRUN" width="1" begin="7" end="7" resetval="0x0" description="Enable Buffer Underrun Interrupt to INT1 bit This is an enable register which decides whether an interrupt (RX_INT1) will be generated on the enabled event.  0h (R/W) = This event will not trigger an interrupt on RX_INT1. 1h (R/W) = A buffer underrun event will trigger an interrupt on RX_INT1. The event itself will be latched in the corresponding bit in the RX_EVT_STS Register" range="7" rwaccess="RW"/> 
		<bitfield id="INT1_EN_FRAME_DONE" width="1" begin="6" end="6" resetval="0x0" description="Enable Frame Done Interrupt to INT1 bit This is an enable register which decides whether an interrupt (RX_INT1) will be generated on the enabled event.  0h (R/W) = This event will not trigger an interrupt on RX_INT1. 1h (R/W) = A frame done event will trigger an interrupt on RX_INT1. The event itself will be latched in the corresponding bit in the RX_EVT_STS Register" range="6" rwaccess="RW"/> 
		<bitfield id="INT1_EN_OVERRUN" width="1" begin="5" end="5" resetval="0x0" description="Enable Receive Buffer Overrun Interrupt to INT1 bit This is an enable register which decides whether an interrupt (RX_INT1) will be generated on the enabled event.  0h (R/W) = This event will not trigger an interrupt on RX_INT1. 1h (R/W) = A receive buffer overrun event will trigger an interrupt on RX_INT1. The event itself will be latched in the corresponding bit in the RX_EVT_STS Register" range="5" rwaccess="RW"/> 
		<bitfield id="INT1_EN_EOF_ERR" width="1" begin="4" end="4" resetval="0x0" description="Enable End-of-Frame Error Interrupt to INT1 bit This is an enable register which decides whether an interrupt (RX_INT1) will be generated on the enabled event.  0h (R/W) = This event will not trigger an interrupt on RX_INT1. 1h (R/W) = An end-of-frame error event will trigger an interrupt on RX_INT1. The event itself will be latched in the corresponding bit in the RX_EVT_STS Register" range="4" rwaccess="RW"/> 
		<bitfield id="INT1_EN_TYPE_ERR" width="1" begin="3" end="3" resetval="0x0" description="Enable Frame Type Error Interrupt to INT1 bit This is an enable register which decides whether an interrupt (RX_INT1) will be generated on the enabled event.  0h (R/W) = This event will not trigger an interrupt on RX_INT1. 1h (R/W) = A frame type error event will trigger an interrupt on RX_INT1. The event itself will be latched in the corresponding bit in the RX_EVT_STS Register" range="3" rwaccess="RW"/> 
		<bitfield id="INT1_EN_CRC_ERR" width="1" begin="2" end="2" resetval="0x0" description="Enable CRC Error Interrupt to INT1 bit This is an enable register which decides whether an interrupt (RX_INT1) will be generated on the enabled event.  0h (R/W) = This event will not trigger an interrupt on RX_INT1. 1h (R/W) = A CRC error will trigger an interrupt on RX_INT1. The event itself will be latched in the corresponding bit in the RX_EVT_STS Register" range="2" rwaccess="RW"/> 
		<bitfield id="INT1_EN_FRAME_WD_TO" width="1" begin="1" end="1" resetval="0x0" description="Enable Frame Watchdog Timeout Interrupt to INT1 bit This is an enable register which decides whether an interrupt (RX_INT1) will be generated on the enabled event.  0h (R/W) = This event will not trigger an interrupt on RX_INT1. 1h (R/W) = A frame watchdog timeout event will trigger an interrupt on RX_INT1. The event itself will be latched in the corresponding bit in the RX_EVT_STS Register" range="1" rwaccess="RW"/> 
		<bitfield id="INT1_EN_PING_WD_TO" width="1" begin="0" end="0" resetval="0x0" description="Enable Ping Watchdog Timeout Interrupt to INT1 bit This is an enable register which decides whether an interrupt (RX_INT1) will be generated on the enabled event.  0h (R/W) = This event will not trigger an interrupt on RX_INT1. 1h (R/W) = A ping watchdog timeout event will trigger an interrupt on RX_INT1. The event itself will be latched in the corresponding bit in the RX_EVT_STS Register" range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_FSI0_RX0_RX_INT2_CTRL_ALT1_" acronym="CONTROLSS_FSI0_RX0_RX_INT2_CTRL_ALT1_" offset="0x3A" width="16" description="">
		<bitfield id="INT2_EN_ERROR_TAG_MATCH" width="1" begin="14" end="14" resetval="0x0" description="Enable Error Frame Received with Tag Match Interrupt to INT2 bit This is an enable register which decides whether an interrupt (RX_INT2) will be generated on the enabled event.  0h (R/W) = This event will not trigger an interrupt on RX_INT2. 1h (R/W) = An error frame received with matching tag will trigger an interrupt on RX_INT2. The event itself will be latched in the corresponding bit in the RX_EVT_STS Register" range="14" rwaccess="RW"/> 
		<bitfield id="INT2_EN_DATA_TAG_MATCH" width="1" begin="13" end="13" resetval="0x0" description="Enable Data Frame Received with Tag Match Interrupt to INT2 bit This is an enable register which decides whether an interrupt (RX_INT2) will be generated on the enabled event.  0h (R/W) = This event will not trigger an interrupt on RX_INT2. 1h (R/W) = A data frame received with matching tag will trigger an interrupt on RX_INT2. The event itself will be latched in the corresponding bit in the RX_EVT_STS Register" range="13" rwaccess="RW"/> 
		<bitfield id="INT2_EN_PING_TAG_MATCH" width="1" begin="12" end="12" resetval="0x0" description="Enable Ping Frame Received with Tag Match Interrupt to INT2 bit This is an enable register which decides whether an interrupt (RX_INT2) will be generated on the enabled event.  0h (R/W) = This event will not trigger an interrupt on RX_INT2. 1h (R/W) = A ping frame received with matching tag will trigger an interrupt on RX_INT2. The event itself will be latched in the corresponding bit in the RX_EVT_STS Register" range="12" rwaccess="RW"/> 
		<bitfield id="INT2_EN_DATA_FRAME" width="1" begin="11" end="11" resetval="0x0" description="Enable Data Frame Received Interrupt to INT2 bit This is an enable register which decides whether an interrupt (RX_INT2) will be generated on the enabled event.  0h (R/W) = This event will not trigger an interrupt on RX_INT2. 1h (R/W) = A data frame received event will trigger an interrupt on RX_INT2. The event itself will be latched in the corresponding bit in the RX_EVT_STS Register" range="11" rwaccess="RW"/> 
		<bitfield id="INT2_EN_FRAME_OVERRUN" width="1" begin="10" end="10" resetval="0x0" description="Enable Frame Overrun Interrupt to INT2 bit This is an enable register which decides whether an interrupt (RX_INT2) will be generated on the enabled event.  0h (R/W) = This event will not trigger an interrupt on RX_INT2. 1h (R/W) = A frame overrun event will trigger an interrupt on RX_INT2. The event itself will be latched in the corresponding bit in the RX_EVT_STS Register" range="10" rwaccess="RW"/> 
		<bitfield id="INT2_EN_PING_FRAME" width="1" begin="9" end="9" resetval="0x0" description="Enable Ping Frame Received Interrupt to INT2 bit This is an enable register which decides whether an interrupt (RX_INT2) will be generated on the enabled event.  0h (R/W) = This event will not trigger an interrupt on RX_INT2. 1h (R/W) = A ping frame received event will trigger an interrupt on RX_INT2. The event itself will be latched in the corresponding bit in the RX_EVT_STS Register" range="9" rwaccess="RW"/> 
		<bitfield id="INT2_EN_ERR_FRAME" width="1" begin="8" end="8" resetval="0x0" description="Enable Error Frame Received Interrupt to INT2 bit This is an enable register which decides whether an interrupt (RX_INT2) will be generated on the enabled event.  0h (R/W) = This event will not trigger an interrupt on RX_INT2. 1h (R/W) = A error frame received event will trigger an interrupt on RX_INT2. The event itself will be latched in the corresponding bit in the RX_EVT_STS Register" range="8" rwaccess="RW"/> 
		<bitfield id="INT2_EN_UNDERRUN" width="1" begin="7" end="7" resetval="0x0" description="Enable Buffer Underrun Interrupt to INT2 bit This is an enable register which decides whether an interrupt (RX_INT2) will be generated on the enabled event.  0h (R/W) = This event will not trigger an interrupt on RX_INT2. 1h (R/W) = A buffer underrun event will trigger an interrupt on RX_INT2. The event itself will be latched in the corresponding bit in the RX_EVT_STS Register" range="7" rwaccess="RW"/> 
		<bitfield id="INT2_EN_FRAME_DONE" width="1" begin="6" end="6" resetval="0x0" description="Enable Frame Done Interrupt to INT2 bit This is an enable register which decides whether an interrupt (RX_INT2) will be generated on the enabled event.  0h (R/W) = This event will not trigger an interrupt on RX_INT2. 1h (R/W) = A frame done event will trigger an interrupt on RX_INT2. The event itself will be latched in the corresponding bit in the RX_EVT_STS Register" range="6" rwaccess="RW"/> 
		<bitfield id="INT2_EN_OVERRUN" width="1" begin="5" end="5" resetval="0x0" description="Enable Buffer Overrun Interrupt to INT2 bit This is an enable register which decides whether an interrupt (RX_INT2) will be generated on the enabled event.  0h (R/W) = This event will not trigger an interrupt on RX_INT2. 1h (R/W) = A buffer overrun event will trigger an interrupt on RX_INT2. The event itself will be latched in the corresponding bit in the RX_EVT_STS Register" range="5" rwaccess="RW"/> 
		<bitfield id="INT2_EN_EOF_ERR" width="1" begin="4" end="4" resetval="0x0" description="Enable End-of-Frame Error Interrupt to INT2 bit This is an enable register which decides whether an interrupt (RX_INT2) will be generated on the enabled event.  0h (R/W) = This event will not trigger an interrupt on RX_INT2. 1h (R/W) = An end-of-frame error event will trigger an interrupt on RX_INT2. The event itself will be latched in the corresponding bit in the RX_EVT_STS Register" range="4" rwaccess="RW"/> 
		<bitfield id="INT2_EN_TYPE_ERR" width="1" begin="3" end="3" resetval="0x0" description="Enable Frame Type Error Interrupt to INT2 bit This is an enable register which decides whether an interrupt (RX_INT2) will be generated on the enabled event.  0h (R/W) = This event will not trigger an interrupt on RX_INT2. 1h (R/W) = A frame type error event will trigger an interrupt on RX_INT2. The event itself will be latched in the corresponding bit in the RX_EVT_STS Register" range="3" rwaccess="RW"/> 
		<bitfield id="INT2_EN_CRC_ERR" width="1" begin="2" end="2" resetval="0x0" description="Enable CRC Error Interrupt to INT2 bit This is an enable register which decides whether an interrupt (RX_INT2) will be generated on the enabled event.  0h (R/W) = This event will not trigger an interrupt on RX_INT2. 1h (R/W) = A CRC error will trigger an interrupt on RX_INT2. The event itself will be latched in the corresponding bit in the RX_EVT_STS Register" range="2" rwaccess="RW"/> 
		<bitfield id="INT2_EN_FRAME_WD_TO" width="1" begin="1" end="1" resetval="0x0" description="Enable Frame Watchdog Timeout Interrupt to INT2 bit This is an enable register which decides whether an interrupt (RX_INT2) will be generated on the enabled event.  0h (R/W) = This event will not trigger an interrupt on RX_INT2. 1h (R/W) = A frame watchdog timeout event will trigger an interrupt on RX_INT2. The event itself will be latched in the corresponding bit in the RX_EVT_STS Register" range="1" rwaccess="RW"/> 
		<bitfield id="INT2_EN_PING_WD_TO" width="1" begin="0" end="0" resetval="0x0" description="Enable Ping Watchdog Timeout Interrupt to INT2 bit This is an enable register which decides whether an interrupt (RX_INT2) will be generated on the enabled event.  0h (R/W) = This event will not trigger an interrupt on RX_INT2. 1h (R/W) = A ping watchdog timeout event will trigger an interrupt on RX_INT2. The event itself will be latched in the corresponding bit in the RX_EVT_STS Register" range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_FSI0_RX0_RX_LOCK_CTRL" acronym="CONTROLSS_FSI0_RX0_RX_LOCK_CTRL" offset="0x3C" width="16" description="">
		<bitfield id="KEY" width="8" begin="15" end="8" resetval="0x0" description="Write Key. In order to write to this register, 0xA5 must be written to this field at the same time. Otherwise, writes are ignored. The key is cleared immediately after writing, so it must be written again for every change to this register." range="15 - 8" rwaccess="WO"/> 
		<bitfield id="LOCK" width="1" begin="0" end="0" resetval="0x0" description="Control Register Lock Enable bit This bit locks the contents of all the receive control registers that support a lock protection. Once locked, further writes will not take effect until SYSRS unlocks the register. Once set, further writes even to this bit will be ignored.  0h (R/W) = Receive control registers can be modified and are not locked. 1h (R/W) = Receive control registers are locked and cannot be modified until this bit is cleared by SYSRS. Any further writes to this bit are ignored.  Note: The KEY field must contatin 0xA5 for any write to this bit to take effect." range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_FSI0_RX0_RX_ECC_DATA" acronym="CONTROLSS_FSI0_RX0_RX_ECC_DATA" offset="0x40" width="32" description="">
		<bitfield id="DATA_HIGH" width="16" begin="31" end="16" resetval="0x0" description="Upper 16 bits of ECC Data Writing to this bitfield will cause the ECC logic to compute the ECC(SEC-DED) the entire 32-bit register and update TX_ECC_VAL register with the results. Software should write to these 16 bits of the register in a 32-bit write when needing to compute ECC for 32-bits for the full TX_ECC_DATA register." range="31 - 16" rwaccess="RW"/> 
		<bitfield id="DATA_LOW" width="16" begin="15" end="0" resetval="0x0" description="Lower 16 bits of ECC Data Writing to this bitfield will cause the ECC logic to compute the ECC(SEC-DED) for these 16 bits and update the TX_ECC_VAL register with the results. Software should write to these register bits as a 16-bit write when needing to compute ECC for 16-bits." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_FSI0_RX0_RX_ECC_VAL" acronym="CONTROLSS_FSI0_RX0_RX_ECC_VAL" offset="0x44" width="16" description="">
		<bitfield id="ECC_VAL" width="7" begin="6" end="0" resetval="0x0" description="ECC Value for SEC-DED check This field contains the ECC value to be used for SEC-DED either for 16-bit or 32-bit data in the RX_ECC_DATA register." range="6 - 0" rwaccess="RW"/>
	</register>
